<?php
echo "<B> ※ 문자열을 잘라서 출력하는 함수 사용 </B> <br>";
echo "---------------------------------------------------------------------------- <br>";
$a = "오늘은 어제 죽어간 이가 그토록 기다리던 내일이다.";
$b = "Have a good time.";
echo " > 주어진 문장 :  $a <br> ";
echo " > 주어진 문장 :  $b <br> ";
echo "---------------------------------------------------------------------------- <br>";
$str [0] = substr($a, 3);
$str [1] = substr($a, 6, 10);
$str [2] = substr($a, -10);
$str [3] = substr($a, -17, 10);
$str [4] = substr($b, 4);
$str [5] = substr($b, 5, 6);
$str [6] = substr($b, -10, 4);
$str [7] = strchr ($a, "이가");
$str [8] = strchr ($b, "g");

for($a = 0; $a <= 8; $a++)
{
	echo " 배열[{$a}] ...  [ " .  $str[$a]  . " ] <br>";   // 자른 문자열 출력
}
echo "---------------------------------------------------------------------------- <br>";
?>